grevaillot/svd_tools/headers/ATSAMV71Q19/memorymap.h
#pragma once 

#define LOCKBIT_BASE			(0x00000000)
#define HSMCI_BASE			(0x40000000)
#define SSC_BASE			(0x40004000)
#define SPI0_BASE			(0x40008000)
#define TC0_BASE			(0x4000c000)
#define TC1_BASE			(0x40010000)
#define TC2_BASE			(0x40014000)
#define TWIHS0_BASE			(0x40018000)
#define TWIHS1_BASE			(0x4001c000)
#define PWM0_BASE			(0x40020000)
#define USART0_BASE			(0x40024000)
#define USART1_BASE			(0x40028000)
#define USART2_BASE			(0x4002c000)
#define MCAN0_BASE			(0x40030000)
#define MCAN1_BASE			(0x40034000)
#define USBHS_BASE			(0x40038000)
#define AFEC0_BASE			(0x4003c000)
#define DACC_BASE			(0x40040000)
#define ACC_BASE			(0x40044000)
#define ICM_BASE			(0x40048000)
#define ISI_BASE			(0x4004c000)
#define GMAC_BASE			(0x40050000)
#define TC3_BASE			(0x40054000)
#define SPI1_BASE			(0x40058000)
#define PWM1_BASE			(0x4005c000)
#define TWIHS2_BASE			(0x40060000)
#define AFEC1_BASE			(0x40064000)
#define MLB_BASE			(0x40068000)
#define AES_BASE			(0x4006c000)
#define TRNG_BASE			(0x40070000)
#define XDMAC_BASE			(0x40078000)
#define QSPI_BASE			(0x4007c000)
#define SMC_BASE			(0x40080000)
#define SDRAMC_BASE			(0x40084000)
#define MATRIX_BASE			(0x40088000)
#define UTMI_BASE			(0x400e0400)
#define PMC_BASE			(0x400e0600)
#define UART0_BASE			(0x400e0800)
#define CHIPID_BASE			(0x400e0940)
#define UART1_BASE			(0x400e0a00)
#define EFC_BASE			(0x400e0c00)
#define PIOA_BASE			(0x400e0e00)
#define PIOB_BASE			(0x400e1000)
#define PIOC_BASE			(0x400e1200)
#define PIOD_BASE			(0x400e1400)
#define PIOE_BASE			(0x400e1600)
#define RSTC_BASE			(0x400e1800)
#define SUPC_BASE			(0x400e1810)
#define RTT_BASE			(0x400e1830)
#define WDT_BASE			(0x400e1850)
#define RTC_BASE			(0x400e1860)
#define GPBR_BASE			(0x400e1890)
#define RSWDT_BASE			(0x400e1900)
#define UART2_BASE			(0x400e1a00)
#define UART3_BASE			(0x400e1c00)
#define UART4_BASE			(0x400e1e00)
#define SCnSCB_BASE			(0xe000e000)
#define SysTick_BASE			(0xe000e010)
#define NVIC_BASE			(0xe000e100)
#define SCB_BASE			(0xe000ed00)
#define MPU_BASE			(0xe000ed90)
#define FPU_BASE			(0xe000ef30)
